In [189]:
import pandas as pd
import json
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy.engine import create_engine
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Loading data

In [190]:
# Load in the the csvs into dataframes from project part 1 :
basics = pd.read_csv('/Users/faris/Documents/GitHub/IMDB/part 1 csvs/basics.csv')
ratings = pd.read_csv('/Users/faris/Documents/GitHub/IMDB/part 1 csvs/ratings.csv')
akas = pd.read_csv('/Users/faris/Documents/GitHub/IMDB/part 1 csvs/akas.csv')

# combined tmdb dataframe
df = pd.read_csv('/Users/faris/Documents/GitHub/IMDB/part 2 csvs/tmdb_results_combined.csv')

# Part 1-  Required Transformation Steps for Title Basics:

In [191]:
display(basics.head())
basics.info()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146714 entries, 0 to 146713
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          146714 non-null  object
 1   titleType       146714 non-null  object
 2   primaryTitle    146714 non-null  object
 3   originalTitle   146714 non-null  object
 4   isAdult         146714 non-null  int64
 5   startYear       146714 non-null  int64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  146714 non-null  int64
 8   genres          146714 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 10.1+ MB

## 1- Getting list of unique genres

### converting the single string of genres from title basics into 2 new tables

In [192]:
# checking a value from genres column
genres_test = basics.loc[0,'genres']
display(type(genres_test))
genres_test

str

'Comedy,Fantasy,Romance'

In [193]:
# creating list of genres column
basics['genres_split'] = basics['genres'].str.split(',')
basics['genres_split'].head()

0    [Comedy, Fantasy, Romance]
1                       [Drama]
2                       [Drama]
3                  [Drama, War]
4      [Comedy, Horror, Sci-Fi]
Name: genres_split, dtype: object

In [194]:
# using explode to seperate list of genres 
exploded = basics.explode('genres_split')
exploded.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama

In [195]:
# using unique to get unique values from the genres split column we created
unique_genres = sorted(exploded['genres_split'].dropna().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## 2- Creating a new title_genres table

In [196]:
title_genres = exploded[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## 3- Creating genre mapper dictionary to replace string genres with integers

In [197]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [198]:
## making a dictionary with list of unique genres as the key and hte new integer id as values
genre_id_map = dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## 4- Replacing the string genres in title_genres with the new integer ids.

In [199]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [200]:
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## 5- Converting the genre map dictionary into a dataframe

In [201]:
genres = pd.DataFrame({'genre_name': genre_id_map.keys(),
                       'genre_id': genre_id_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### discarding unnecessary information

In [202]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [203]:
basics.drop(columns=['titleType','originalTitle','isAdult','endYear','genres','genres_split'],inplace=True)
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0079644,November 1828,2001,140
4,tt0088751,The Naked Monster,2005,100

In [204]:
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.0,3.0,NaN

In [205]:
df = df[['imdb_id','revenue','budget','certification']]
df.head()

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN
3  tt0116391      0.0         0.0           NaN
4  tt0116748      0.0         0.0           NaN

# Part 2- Saving the mySQL tables

## Creating database

In [206]:
username = "root"
password = "rootroot" 
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)

In [207]:
# creating database
create_database(connection)

# checking if it exists
database_exists(connection)

True

In [208]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

## Making sure to set the primary key

In [209]:
# checking dtype of dataframe
basics.dtypes

tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
dtype: object

In [210]:
# converting startYear to float
basics['startYear'] = basics['startYear'].astype(float)
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

In [234]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
max_key_len = basics['tconst'].fillna('').map(len).max()
max_title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_sql_datatype = {
    "tconst": String(max_key_len+1), 
    "primaryTitle": Text(max_title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

## Running df.to_sql with the dtype argument.

In [235]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics', engine, dtype= basics_sql_datatype, if_exists='replace', index=False)

146714

## Running the query to ADD PRIMARY KEY

In [236]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Testing sql query to display first 3 rows

In [237]:
q1 = """select * 
        from title_basics 
        limit 3;"""

pd.read_sql(q1,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122

## Ratings schema

In [238]:
display(ratings.dtypes)

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [239]:
# max string length for tconst column which is the only object column
max_len_ratings_tconst = ratings['tconst'].fillna('').map(len).max()

# creating schema dictionary
ratings_sql_datatype = {'tconst': String(max_len_ratings_tconst+1),
                        'averageRating': Float(),
                        'numVotes': Integer()}

# adding the table to the database
ratings.to_sql('title_ratings', engine, dtype = ratings_sql_datatype, if_exists = 'replace', index = False)

496733

In [242]:
# setting tconst column as primary key

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (tconst);')

### Testing sql by running query

In [243]:
q2 = """select * 
        from title_ratings
         limit 3;"""

pd.read_sql(q2,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607

## Title_Genres schema

In [219]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [244]:
# max string length for tconst column which is the only object column
max_len_title_genres_tconst = title_genres['tconst'].fillna('').map(len).max()

# creating schema dictionary
title_genres_sql_datatype = {'tconst': String(max_len_title_genres_tconst+1),
                             'genre_id': Integer()}

# adding the table to the database
title_genres.to_sql('title_genres', engine, dtype = title_genres_sql_datatype, if_exists = 'replace', index = False)

254960

### Testing sql by running query

In [246]:
q3 = """select * 
        from title_genres
        limit 3;"""

pd.read_sql(q3,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18

## genres datatype schema

In [222]:
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [247]:
# max string length for genre_name column which is the only object column
max_len_genre_name = genres['genre_name'].fillna('').map(len).max()

# creating schema dictionary
genres_sql_datatype = {'tconst': String(max_len_genre_name+1),
                             'genre_id': Integer()}

# adding the table to the database
genres.to_sql('genres', engine, dtype = genres_sql_datatype, if_exists = 'replace', index = False)

26

### Testing sql by running query

In [248]:
# setting the genre_id as primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (genre_id);')

In [249]:
q4 = """select * 
        from genres
        limit 3;"""

pd.read_sql(q4,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

## IMDB database full

In [250]:
df.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [259]:
display(df.head())

# dropping first row
df.drop(0,inplace=True)

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN
3  tt0116391      0.0         0.0           NaN
4  tt0116748      0.0         0.0           NaN

In [260]:
df.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0116748         0.0         0.0           NaN
5  tt0118694  12854953.0    150000.0            PG

In [262]:
max_len_imdb_id = df['imdb_id'].fillna('').map(len).max()
max_len_certification = df['certification'].fillna('').map(len).max()

imdb_sql_datatype = {'imdb_id': String(max_len_imdb_id+1),
                     'revenue': Float(),
                     'budget': Float(),
                     'certification': Text(max_len_certification+1)}

In [263]:
# adding table to database
df.to_sql('imdb_data', engine, dtype = imdb_sql_datatype, if_exists = 'replace', index = False)

4516

In [264]:
q5 = """select * 
        from imdb_data
        limit 3;"""

pd.read_sql(q5,engine)

     imdb_id  revenue      budget certification
0  tt0113026      0.0  10000000.0          None
1  tt0113092      0.0         0.0          None
2  tt0116391      0.0         0.0          None

In [265]:
# setting imdb_id column as primary key
engine.execute('ALTER TABLE imdb_data ADD PRIMARY KEY (imdb_id);')

# Final query to check tables in Movie database

In [266]:
q6 = """show tables;"""

pd.read_sql(q6,engine)

  Tables_in_movies
0           genres
1        imdb_data
2     title_basics
3     title_genres
4    title_ratings